Repository: Stephixus/my-weather-indicator
Catalog: po/*.po
Languages: hu, is, ja

source: Where Am I
hu: Hol vagyok?
is: Hvar er ég
ja: 今の場所

source: Search location
hu: Hely keresése
ja: 検索

source: Clear location
hu: Hely törlése
ja: クリア

source: Input the name of your city
hu: A városának a neve
ja: 都市名を入力

source: Search
hu: Keresés
is: Leita
ja: 探す

source: Find me
hu: Keressen meg!
is: Finna mig
ja: 自動検出

source: City
hu: Város
ja: 市町村

source: State
hu: Állam
ja: 都道府県

source: Country
hu: Ország
ja: 国

source: Preferences
hu: Beállítások
is: Valkostir
ja: 設定

source: Main Location
hu: Elsődleges hely
is: Staðsetning
ja: 場所（メイン）

source: General options
hu: Általános beállítások
is: Almennir valkostir
ja: 一般

source: Auto Location
hu: Automatikus helymeghatározás
is: Sjálfvirk leit
ja: 自動検出

source: Locality
hu: Helység
is: Staður
ja: 場所

source: Search Location
hu: Hely keresése
is: Leita að staðsetningu
ja: 場所を探す

source: Show temperature
hu: Hőmérséklet kijelzése
is: Sýna hitastig
ja: 気温を表示

source: Show notifications
hu: Értesítések megjelenítése
is: Sýna tilkynningar
ja: 通知を表示

source: Show widget
hu: Felületi elem megjelenítése
is: Sýna græju
ja: ウィジェットを表示

source: Hide indicator when show widget
hu: Állapotmenü elrejtése a felületi elem megjelenítésekor
is: Fela vísi þegar græjan er sýnileg
ja: ウィジェット表示でインジケーターを隠す

source: Widget on top
hu: Felületi elem mindig felül
is: Græja efst
ja: ウィジェットを最前面に配置

source: Show in taskbar
hu: Megjelenítés a panelen
is: Sýna í tækjastiku
ja: タスクバーに表示

source: Second Location
hu: Másodlagos hely
is: Önnur staðsetning
ja: 別の場所

source: Weather Services
hu: Időjárás szolgáltatók
is: Veður þjónusta
ja: ウェザーサービス

source: Input World Weather Online key
hu: World Weather Online kapcsolódási kód
ja: World Weather OnlineのKEYを入力

source: Activate
hu: Aktiválás
ja: アクティベート

source: Click to activate World Weather Online
hu: Kattintson a World Weather Online aktiválásához
ja: クリックしてWorld Weather Onlineを有効にする

source: Input Weather Underground key
hu: Weather Underground kapcsolódási kód
ja: Weather UndergroundのKEYを入力

source: Click to activate Weather Underground
hu: Kattintson a Weather Underground aktiválásához
ja: クリックしてWeather Undergroundを有効にする

source: Units
hu: Mértékegységek
is: Einingar
ja: 単位

source: Temperature
hu: Hőmérséklet
is: Hitastig
ja: 気温

source: Celsius
is: Selsíus
ja: C

source: Fahrenheit
ja: F

source: Kelvin
ja: ケルビン

source: Pressure
hu: Légnyomás
is: Þrýstingur
ja: 気圧

source: Millibar
ja: ミリバール

source: Inches of mercury
hu: higanyhüvelyk
is: inHg (Inches of mercury)
ja: 水銀柱インチ

source: Millimeters of mercury
hu: higanymilliméter
is: mmHg (Millimeters of mercury)
ja: 水銀柱ミリ

source: Visibility
hu: Látótávolság
is: Skyggni
ja: 視程

source: mile
hu: mérföld
is: míla
ja: マイル

source: kilometer
hu: kilométer
is: kílómeter
ja: キロメートル

source: Wind velocity
hu: Szélsebesség
is: Vindhraði
ja: 風速

source: Beaufort
ja: ビューフォート風力

source: knots
hu: csomó
is: hnútar
ja: ノット

source: Rain Gauge
hu: Eső
is: Úrkomumælir
ja: 雨量

source: Inches
hu: hüvelyk
is: Tommur
ja: インチ

source: Centimeters
hu: centiméter
is: Sentimetrar
ja: センチメートル

source: Millimeters
hu: milliméter
is: Millimetrar
ja: ミリメートル

source: Snow Gauge
hu: Hó
is: Snjómælir
ja: 積雪

source: Time Format
hu: Idő formátum
is: Tímasnið
ja: 時刻の形式

source: 24 h
hu: 24 óra
is: 24 klst
ja: 24時間

source: AM/PM
hu: De./Du.
is: FH/EH
ja: 午前/午後

source: Autostart
hu: Automatikus indítás
is: Sjálfræsing
ja: 自動起動

source: Refresh frequency
hu: Frissítési gyakoriság
is: Uppfærslutíðni
ja: 更新間隔

source: minutes
hu: perc
ja: 分

source: hour
hu: óra
ja: 時間

source: hours
hu: óra
ja: 時間

source: Select icon theme
hu: Ikontéma
is: Þema táknmynda
ja: アイコンテーマを選択

source: N/A
is: Ekki tiltækt
ja: データなし

source: Blowing sand
hu: Homokfúvás
is: Sandstormur
ja: 風砂

source: Blizzard
hu: Hóvihar
is: Hríðarbylur
ja: 猛吹雪

source: Blowing snow
hu: Hófúvás
is: Hríð
ja: 地吹雪

source: Blowing widespread dust
hu: Nagy kiterjedésű por
is: Dreift sandfok
ja: 強い砂塵

source: Chance of a thunderstorm
hu: Előfordulhatnak zivatarok
is: Líkur á þrumuveðri
ja: 雷雨のおそれ

source: Chance of flurries
hu: Előfordulhatnak hózáporok
is: Líkur á vindhviðum
ja: 突風のおそれ

source: Chance of rain
hu: Előfordulhat eső
is: Líkur á rigningu
ja: 雨の可能性

source: Chance of showers
hu: Előfordulhat zápor
is: Líkur á úrhelli
ja: にわか雨の可能性

source: Chance of snow
hu: Előfordulhat havazás
is: Líkur á snjókomu
ja: 雪の可能性

source: Chance of storm
hu: Előfordulhat vihar
is: Líkur á stormi
ja: 嵐のおそれ

source: Chance of thunderstorms
hu: Előfordulhatnak zivatarok
is: Líkur á þrumuveðri
ja: 雷雨のおそれ

source: Chance of tstorm
hu: Előfordulhat vihar
is: Líkur á þrumuveðri
ja: 雷をともなう暴風雨のおそれ

source: Clear
hu: Tiszta
is: Heiðskýrt
ja: 晴れ

source: Cloudy
hu: Felhős
is: Skýjað
ja: くもり

source: Cold
hu: Hideg
is: Kalt
ja: 寒い

source: Drizzle
hu: Szitáló eső
is: Súld
ja: こぬか雨

source: Drizzle rain
hu: Szitáló eső
is: Úðaregn
ja: 霧雨

source: Dust whirls
hu: Portölcsérek
is: Rykstrókur
ja: 塵旋風

source: Dust
hu: Por
is: Sandfok
ja: 塵

source: Extreme rain
hu: Extrém eső
is: Meiriháttar úrfelli
ja: 大雨

source: Fair
hu: Szép idő
is: Bjartviðri
ja: 晴れ

source: Flurries
hu: Széllökések
is: Él eða skúrir
ja: 突風

source: Fog patches
hu: Ködfoltok
is: Þokuflákar
ja: ところどころ霧

source: Fog
hu: Köd
is: Þoka
ja: 霧

source: Foggy
hu: Ködös
is: Þoka
ja: 霧

source: Freezing drizzle
hu: Ónos szitálás
is: Frostúði
ja: 凍った霧雨

source: Freezing fog
hu: Ónos köd
is: Hrímþoka
ja: 凍った霧

source: Freezing rain
hu: Ónos eső
is: Frostrigning
ja: 凍った雨

source: Funnel cloud
hu: Tölcsérfelhő
is: Skýstrokkur
ja: ろうと雲

source: Hail showers
hu: Zuhogó jégeső
is: Haglél
ja: 打ちつけるような雹 (ひょう)

source: Hail
hu: Jégeső
is: Hagl
ja: 雹（ひょう）

source: Haze
hu: Köd
is: Mistur
ja: もや

source: Heavy freezing drizzle
hu: Erős ónos szitálás
is: Frostúði
ja: 激強い凍った霧雨

source: Heavy rain
hu: Heves esőzés
is: Úrfellisrigning
ja: 強い雨

source: Heavy rain at times
hu: Időnként heves esőzés
is: Úrfellisrigning
ja: 時々強い雨

source: Heavy snow
hu: Erős havazás
is: Mikil snjókoma
ja: 強い雪

source: Heavy thunderstorm
hu: Erős vihar
is: Meiriháttar þrumuveður
ja: 強い雷雨

source: Hot
hu: Hőség
is: Heitt
ja: 暑い

source: Hurricane
hu: Orkán
is: Fárviðri
ja: ハリケーン

source: Ice crystals
hu: Jégkristályok
is: Ískristallar
ja: 氷晶

source: Ice pellet showers
hu: Jégeső
is: Ískornsél
ja: にわか凍雨

source: Ice pellets
hu: Jégdara
is: Ískorn
ja: 凍雨

source: Icy
hu: Jéghideg
is: Ískaldur
ja: 非常に冷たい

source: Isolated showers
hu: Elszórtan záporok
is: Staðbundinn skúr
ja: ところによりにわか雨

source: Isolated thunderstorms
hu: Elszórtan zivatarok
is: Staðbundið þrumuveður
ja: ところにより雷雨

source: Light drizzle
hu: Gyenge szitálás
is: Lítilsháttar súld
ja: 弱い霧雨

source: Light freezing rain
hu: Gyenge ónos eső
is: Lítilsháttar frostrigning
ja: 弱い凍った霧雨

source: Light rain shower
hu: Gyenge záporok
is: Lítilsháttar skúrir
ja: 弱いにわか雨

source: Light rain
hu: Csendes eső
is: Lítilsháttar rigning
ja: 弱い雨

source: Light showers of ice pellets
hu: Csendes eső jégdarával
is: Lítilsháttar ískorna skúrir
ja: 弱い凍ったにわか雨

source: Light sleet showers
hu: Gyenge ónos záporok
is: Lítilsháttar slydduél
ja: 弱いみぞれにわか雨

source: Light sleet
hu: Gyenge ónos eső
is: Lítilsháttar slydda
ja: 弱いみぞれ

source: Light snow showers
hu: Gyenge hózáporok
is: Lítilsháttar snjóél
ja: 弱いにわか雪

source: Light snow
hu: Enyhe havazás
is: Lítilsháttar snjókoma
ja: 弱い雪

source: Light thunderstorm
hu: Gyenge zivatarok
is: Lítilsháttar þrumuveður
ja: 弱い雷雨

source: Low drifting sand
hu: Alacsonyan szálló homok
is: Lágur sandbylur
ja: 弱い風塵

source: Low drifting snow
hu: Alacsony szintű hófúvás
is: Skafrenningur
ja: 弱い地吹雪

source: Low drifting widespread dust
hu: Alacsonyan szálló por
is: Rykský
ja: 弱い広範囲の塵

source: Mist
hu: Pára
is: Mistur
ja: もや

source: Mixed rain and snow
hu: Havas eső
is: Slydda
ja: みぞれ

source: Mixed rain and sleet
hu: Eső, havas eső
ja: 雨混じりのみぞれ

source: Mixed snow and sleet
hu: Hó, havas eső
ja: 雪混じりのみぞれ

source: Moderate or heavy freezing rain
hu: Mérsékelt vagy erős ónos eső
is: Miðlungs eða mikil frostrigning
ja: 中程度から激しい凍雨

source: Moderate or heavy rain in area with thunder
hu: Mérsékelt vagy erős eső viharokkal
is: Miðlungs eða mikil riging og eldingar
ja: 雷を伴う中程度から強い雨

source: Moderate or heavy rain shower
hu: Mérsékelt vagy erős záporok
is: Miðlungs eða miklar skúrir
ja: 中程度から強いにわか雨

source: Moderate or heavy showers of ice pellets
hu: Mérsékelt vagy erős havazás jégdarával
is: Miðlungs eða mikil ískorn
ja: 中程度から強い凍ったにわか雨

source: Moderate or heavy sleet showers
hu: Mérsékelt vagy erős ónos záporok
is: Miðlungs eða mikil slydduél
ja: 中程度から強いみぞれにわか雨

source: Moderate or heavy sleet
hu: Mérsékelt vagy erős ónos eső
is: Miðlungs eða mikil slydda
ja: 中程度から強いみぞれ

source: Moderate or heavy snow in area with thunder
hu: Mérsékelt vagy erős havazás viharokkal
is: Miðlungs eða mikill snjór með þrumum
ja: 雷を伴う中程度から強い雪

source: Moderate or heavy snow showers
hu: Mésékelt vagy erős hózápor
is: Miðlungs eða mikil snjóél
ja: 中程度から強いにわか雪

source: Moderate rain at times
hu: Időnként mérsékelt eső
is: Gengur á með skúrum
ja: 時々雨

source: Moderate rain
hu: Mérsékelt eső
is: Miðlungs rigning
ja: 雨

source: Moderate snow
hu: Mérsékelt havazás
is: Miðlungs snjókoma
ja: 雪

source: Mostly cloudy
hu: Nagyrészt felhős
is: Skýjað að mestu
ja: おおむね曇

source: Mostly sunny
hu: Többnyire napos
is: Bjart með mestu
ja: おおむね晴

source: Not available
hu: Nem elérhető
is: Ekki tiltækt
ja: データなし

source: Overcast
hu: Borús
is: Alskýjað
ja: 曇

source: Partial fog
hu: Szórványos ködfoltok
is: Þoka á köflum
ja: 時々霧

source: Partly cloudy
hu: Részben felhős
is: Léttskýjað
ja: 晴時々曇

source: Partly sunny
hu: Részben napos
is: Bjart með köflum
ja: 曇時々晴

source: Patches of fog
hu: Helyenként köd
is: Þokuflákar
ja: 局所的な霧

source: Patchy freezing drizzle nearby
hu: Helyenként ónos szitálás
is: Víða frostúði
ja: 近くで局所的な結氷霧雨

source: Patchy heavy snow
hu: Helyenként erős havazás
is: Víða snjókoma
ja: 局所的な強い雪

source: Patchy light drizzle
hu: Foltokban gyenge szitálás
is: Víða lítilsháttar súld
ja: 局所的な弱い霧雨

source: Patchy light rain in area with thunder
hu: Foltokban eső viharokkal
is: Víða lítilsháttar rigning og þrumur
ja: 局所的に弱い雨ところにより雷

source: Patchy light rain
hu: Foltokban gyenge eső
is: Víða lítilsháttar rigning
ja: 局所的な弱い雨

source: Patchy light snow in area with thunder
hu: Foltokban gyenge havazás viharokkal
is: Víða lítilsháttar snjókoma og þrumur
ja: 局所的に弱い雪ところにより雷

source: Patchy light snow
hu: Foltokban gyenge havazás
is: Víða lítilsháttar snjókoma
ja: 局所的な弱い雪

source: Patchy moderate snow
hu: Foltokban mérsékelt havazás
is: Víða snjókoma
ja: 局所的な雪

source: Patchy rain nearby
hu: Foltokban eső
is: Víða rigning
ja: 近くで局所的な雨

source: Patchy sleet nearby
hu: Foltokban ónos eső
is: Víða slydda
ja: 近くで局所的なみぞれ

source: Patchy snow nearby
hu: Foltokban havazás
is: Víða snjókoma
ja: 近くで局所的な雪

source: Ragged thunderstorm
hu: Helyenként viharok
is: Þrumuveður
ja: 不規則な雷雨

source: Rain and snow
hu: Havas eső
is: Rigning og snjókoma
ja: 雨と雪

source: Rain mist
hu: Ködszitálás
is: Úðamistur
ja: 霧雨

source: Rain showers
hu: Záporok
is: Skúrir
ja: にわか雨

source: Rain
hu: Eső
is: Rigning
ja: 雨

source: Sand
hu: Homok
is: Sandur
ja: 砂

source: Sandstorm
hu: Homokvihar
is: Sandfok
ja: 砂嵐

source: Scattered clouds
hu: Elszórtan felhős
is: Léttskýjað
ja: ちぎれ雲

source: Scattered showers
hu: Szórványosan záporok
is: Skúrir á stöku stað
ja: ところによりにわか雨

source: Scattered thunderstorms
hu: Szórványosan zivatarok
is: Þrumur á stöku stað
ja: ところにより雷雨

source: Shallow fog
hu: Áramló köd
is: Þokumóða
ja: 弱い霧

source: Showers
hu: Záporok
is: Skúrir
ja: にわか雨

source: Shower drizzle
hu: Szitáló, gyenge zápor
is: Úði
ja: にわか霧雨

source: Shower rain
hu: Záporeső
is: Skúrir
ja: にわか雨

source: Shower snow
hu: Hózápor
is: Snjóél
ja: にわか雪

source: Sleet
hu: Ónos eső
is: Slydda
ja: みぞれ

source: Small hail showers
hu: Hódarazápor
is: Haglél
ja: 小さいしゅう雹

source: Small hail
hu: Hódara
is: Haglél
ja: 小さな雹（ひょう）

source: Smoke
hu: Füst
is: Reykur
ja: 霧

source: Snow blowing snow mist
hu: Köd és hófúvás
is: Skafrenningur
ja: 吹雪

source: Snow flurries
hu: Hózáporok
ja: にわか雪

source: Snow grains
hu: Porhó
is: Kornsnjór
ja: 霧雪

source: Snow showers
hu: Hózápor
is: Snjóél
ja: しゅう雪

source: Snow
hu: Havazás
is: Snjókoma
ja: 雪

source: Spray
hu: Permet
is: Úði
ja: しぶき

source: Squalls
hu: Viharok
is: Snöggir vindsveipar
ja: スコール

source: Storm
hu: Erős vihar
is: Óveður
ja: 嵐

source: Sunny
hu: Napos
is: Sólskin
ja: 晴

source: Thunderstorm
hu: Zivatar
is: Þrumuveður
ja: 雷雨

source: Thunderstorms and ice pellets
hu: Zivatarok jégdarával
is: Ískorn og þrumuveður
ja: 雷と凍雨

source: Thunderstorms and rain
hu: Zivatarok esővel
is: Þrumur og eldingar
ja: 雷と雨

source: Thunderstorms and snow
hu: Hózivatar
is: Þrumur og snjór
ja: 雪と雷

source: Thunderstorms with hail
hu: Zivatarok jégesővel
is: Þrumur og haglél
ja: 雷とひょう

source: Thunderstorms with small hail
hu: Viharok kisebb jégesővel
is: Þrumur og haglél
ja: 雷と小さなひょう

source: Thunderstorm with light rain
hu: Viharok gyenge esővel
is: Þrumur og lítilsháttar rigning
ja: 雷と弱い雨

source: Thunderstorm with rain
hu: Viharok esővel
is: Þrumur og eldingar
ja: 雷と雨

source: Thunderstorm with heavy rain
hu: Viharok erős esővel
is: Þrumur og eldingar
ja: 雷と強い雨

source: Thunderstorm with light drizzle
hu: Viharok gyenge, szitáló esővel
is: Þrumur og lítilsháttar súld
ja: 雷と弱い霧雨

source: Thunderstorm with drizzle
hu: Viharok szitáló esővel
is: Þrumur og súld
ja: 雷と霧雨

source: Thunderstorm with heavy drizzle
hu: Viharok és erős szitálás
is: Þrumur og mikill úði
ja: 雷と強いこぬか雨

source: Thundery outbreaks in nearby
hu: Viharos kitörések
is: Þrumur og eldingar í næsta nágrenni
ja: 近くで雷の発生

source: Tornado
hu: Tornádó
is: Hvirfilbylur
ja: 竜巻

source: Torrential rain shower
hu: Zuhogó záporeső
is: Úrhelli
ja: 強いにわか雨

source: Tropical storm
hu: Trópusi vihar
is: Hitabeltisstormur
ja: 熱帯低気圧

source: Unknown precipitation
hu: Ismeretlen csapadék
is: Óþekkt úrkoma
ja: 降雨不明

source: Unknown
hu: Ismeretlen
is: Óþekkt
ja: 不明

source: Very heavy rain
hu: Nagyon heves esőzés
is: Mjög mikil rigning
ja: 猛烈な雨

source: Volcanic ash
hu: Vulkáni hamu
is: Gosaska
ja: 火山灰

source: Widespread dust
hu: Porvihar
is: Rykský yfir öllu
ja: 広範囲の砂塵

source: Windy
hu: Szeles
is: Hvassviðri
ja: 強い風

source: North
hu: északi
is: Norðan
ja: 北

source: North by east
hu: északtól keletre
is: Norður að austri
ja: 北微東

source: North-northeast
hu: észak - északkeleti
is: Norð-norðaustan
ja: 北北東

source: Northeast by north
hu: északkelettől északra
is: Norðaustur að norðri
ja: 北東微北

source: Northeast
hu: északkeleti
is: Norðaustan
ja: 北東

source: Northeast by east
hu: északkelettől keletre
is: Norðaustur að austri
ja: 北東微東

source: East-northeast
hu: kelet-északkeleti
is: Aust-norðaustan
ja: 東南東

source: East by north
hu: kelettől északra
is: Austur að norðri
ja: 東微北

source: East
hu: keleti
is: Austan
ja: 東

source: East by south
hu: kelettől délre
is: Austur að suðri
ja: 東微南

source: East-southeast
hu: kelet-délkeleti
is: Aust-suðaustan
ja: 東南東

source: Southeast by east
hu: délkelettől keletre
is: Suðaustur að austri
ja: 南東微東

source: Southeast
hu: délkeleti
is: Suðaustan
ja: 南東

source: Southeast by south
hu: délkelettől délre
is: Suðaustur að suðri
ja: 南東微南

source: South-southeast
hu: dél-délkeleti
is: Suð-suðaustan
ja: 南南東

source: South by east
hu: déltől keletre
is: Suður að austri
ja: 南微東

source: South
hu: déli
is: Sunnan
ja: 南

source: South by west
hu: déltől nyugatra
is: Suður að vestri
ja: 南微西

source: South-southwest
hu: dél-délnyugati
is: Suð-suðvestan
ja: 南南西

source: Southwest by south
hu: délnyugattól délre
is: Suðvestur að suðri
ja: 南西微南

source: Southwest
hu: délnyugati
is: Suðvestan
ja: 南西

source: Southwest by west
hu: délnyugattól nyugatra
is: Suðvestur að vestri
ja: 南西微西

source: West-southwest
hu: nyugat-délnyugati
is: Vest-suðvestan
ja: 西南西

source: West by south
hu: nyugattól délre
is: Vestur að suðri
ja: 西微南

source: West
hu: nyugati
is: Vestan
ja: 西

source: West by north
hu: nyugattól északra
is: Vestur að norðri
ja: 西微北

source: West-northwest
hu: nyugat-északnyugati
is: Vest-norðvestan
ja: 西北西

source: Northwest by west
hu: északnyugattól nyugatra
is: Norðvestur að vestri
ja: 北西微西

source: Northwest
hu: északnyugati
is: Norðvestan
ja: 北西

source: Northwest by north
hu: északnyugattól északra
is: Norðvestur að norðri
ja: 北西微北

source: North-northwest
hu: észak-északnyugati
is: Norð-norðvestan
ja: 北北西

source: North by west
hu: északtól nyugatra
is: Norður að vestri
ja: 北微西

source: Variable
hu: Változékony
is: Breytileg
ja: 変わりやすい

source: millibar
ja: ミリバール

source: inches of mercury
hu: higanyhüvelyk
is: inHg (inches of mercury)
ja: 水銀柱インチ

source: millimeters of mercury
hu: higanymilliméter
is: mmHg (millimeters of mercury)
ja: 水銀柱ミリメーター

source: Calm
hu: szélcsend
is: Logn
ja: 無風

source: Light air
hu: gyenge szél
is: Andvari
ja: 至軽風

source: Light breeze
hu: gyenge szél
is: Kul
ja: 軟風

source: Gentle breeze
hu: mérsékelt szél
is: Gola
ja: 軟風

source: Moderate breeze
hu: mérsékelt szél
is: Stinningsgola
ja: 和風

source: Fresh breeze
hu: élénk szél
is: Kaldi
ja: 疾風

source: Strong breeze
hu: erős szél
is: Stinningskaldi
ja: 雄風

source: High wind
hu: igen erős szél
is: Allhvass vindur
ja: 強い風

source: Gale
hu: viharos szél
is: Hvassviðri
ja: 強風

source: Strong gale
hu: vihar
is: Stormur
ja: 大強風

source: Violent storm
hu: orkánszerű vihar
is: Ofsaveður
ja: 猛烈な嵐

source: New Moon
hu: Újhold
is: Nýtt tungl
ja: 新月

source: Waxing Crescent
hu: Holdtölte
is: Vaxandi sigð
ja: 新月→上弦

source: First Quarter
hu: Első negyed
is: Fyrsta kvartil
ja: 上弦

source: Waxing Gibbous
hu: Növekvő Hold
is: Gleitt vaxandi
ja: 上弦→満月

source: Full Moon
hu: Telihold
is: Fullt tungl
ja: 満月

source: Waning Gibbous
hu: Fogyó Hold
is: Gleitt minnkandi
ja: 満月→下弦

source: Last Quarter
hu: Utolsó negyed
is: Síðasta kvartil
ja: 下弦

source: Waning Crescent
hu: Fogyó Hold
is: Minnkandi sigð
ja: 下弦→新月

source: Forecast
hu: Előrejelzés
is: Veðurspá
ja: 天気予報

source: Day of week
hu: Napok
is: Dagur
ja: 曜日

source: Sunrise
hu: Napkelte
is: Sólarupprás
ja: 日の出

source: Sunset
hu: Napnyugta
is: Sólsetur
ja: 日の入

source: Moon Phase
hu: Holdfázis
is: Tunglstaða
ja: 月相

source: Condition
hu: Állapot
is: Skilyrði
ja: 天候

source: High temperature
hu: Legmagasabb hőmérséklet
is: Efri hitamörk
ja: 最高気温

source: Low temperature
hu: Legalacsonyabb hőmérséklet
is: Neðri hitamörk
ja: 最低気温

source: Maximum wind
hu: Legnagyobb szélsebesség
is: Hámarks vindur
ja: 最大風速

source: Average wind
hu: Átlagos szélsebesség
is: Meðal vindur
ja: 平均風速

source: Maximum humidity
hu: Maximális páratartalom
is: Hámarks rakastig
ja: 最高湿度

source: Minumum humidity
hu: Minimális páratartalom
is: Lágmarks rakastig
ja: 最低湿度

source: Rain measurement
hu: Csapadék mennyisége
is: Úrkomumæling
ja: 雨量

source: Snow measurement
hu: Hóréteg vastagsága
is: Snjómæling
ja: 積雪

source: Average humidity
hu: Páratartalom
is: Meðal rakastig
ja: 平均湿度

source: Cloudiness
hu: Felhőzet
is: Skýjafar
ja: 雲量

source: Homepage
hu: Honlap
is: Heimasíða
ja: ホームページ

source: Get help online...
hu: Online segítség...
is: Hjálp á vefnum...
ja: オンライン・ヘルプ

source: Translate this application...
hu: Az alkalmazás fordítása...
is: Þýða forritið...
ja: このアプリを翻訳する…

source: Report a bug...
hu: Hibajelentés...
is: Tilkynna villu...
ja: バグ報告…

source: About
hu: Névjegy
is: Um forritið
ja: 情報

source: Evolution
hu: Prognózis
ja: チャート

source: Forecast Map
hu: Előrejelzési térkép
is: Veðurkort
ja: 予報地図

source: Location
hu: Hely
is: Staðsetning
ja: 場所

source: Humidity
hu: Páratartalom
is: Raki
ja: 湿度

source: Feels like
hu: Hőérzet
is: Virkar sem
ja: 体感温度

source: Dew Point
hu: Harmatpont
is: Daggarmörk
ja: 露点

source: Wind
hu: Szél
is: Vindur
ja: 風

source: UV
is: Útfjólublár geisli
ja: 紫外線

source: Precipitation
hu: Csapadék
is: Úrkoma
ja: 降雨量

source: Dawn
hu: Hajnal
is: Dögun
ja: 夜明け（薄明）

source: Dusk
hu: Szürkület
is: Rökkur
ja: 夕暮れ（薄暮）

source: Help
hu: Súgó
is: Hjálp
ja: ヘルプ

source: Exit
hu: Kilépés
is: Loka
ja: 終了

source: Conditions in
hu: Jelenlegi időjárás:
is: Veðurskilyrði
ja: 地域

source: Forecast for next hours
hu: Előrejelzés a következő órákra
ja: 今後の予報

source: Weather service
hu: Meterológiai szolgálat
ja: ウェザーサービス

source: A weather indicator
hu: Időjárás jelző
is: Veðurspá
ja: お天気インジケーター

source: ft/s
hu: láb/s

source: km/h
is: km/klst

source: mph
is: mílur/klst

source: from
is: frá

source: n/a
is: ekki tiltækt

source: mi
is: míl

source: cm
is: sm
